[
    
    {
        "_id": "01",
        "category_id": "01",
        "title": "C++",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/ISO_C%2B%2B_Logo.svg/1200px-ISO_C%2B%2B_Logo.svg.png",
        "details": "C++ (said C plus plus) is an object-oriented computer language created by notable computer scientist Bjorne Stroustrop as part of the evolution of the C family of languages. It was developed as a cross-platform improvement of C to provide developers with a higher degree of control over memory and system resources.Some call C++ “C with classes” because it introduces object-oriented programming principles, including the use of defined classes, to the C programming language framework. Over time, C++ has remained a very useful language not only in computer programming itself, but in teaching new programmers about how object-oriented programming works. However, it does not support only object-oriented, but also procedural and functional. Thanks to its high flexibility and scalability, C++ can be used to develop a broad range of software, applications, browsers, Graphical User Interfaces (GUIs), operating systems, and games.Today C++ is still very appreciated for its notable portability which allows developers to create programs that can run on different operating systems or platforms very easily. Despite being a high-level language, since C++ is still close to C it can be used for low-level manipulation due to its close relation with machine language."
    },
    {
        "_id": "02",
        "category_id": "02",
        "title": "C",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/C_Programming_Language.svg/1200px-C_Programming_Language.svg.png",
        "details": "C is a high-level and general-purpose programming language that is ideal for developing firmware or portable applications. Originally intended for writing system software, C was developed at Bell Labs by Dennis Ritchie for the Unix Operating System in the early 1970s.Ranked among the most widely used languages, C has a compiler for most computer systems and has influenced many popular languages – notably C++."
    },
    {
        "_id": "03",
        "category_id": "03",
        "title": "Python",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Python-logo-notext.svg/1200px-Python-logo-notext.svg.png",
        "details": "Python is a general-purpose, interpreted, high-level programming language popularly used for website development, data analytics and automatio Python is a general-purpose language which means it is versatile and can be used to program many different types of functions. Because it is an interpreted language, it precludes the need for compiling code before execution and because it is a high-level programming language, Python is able to abstract details from code. In fact, Python focuses so much attention on abstraction that its code can be understood by most novice programmers. Python code tends to be short and when compared to compiled languages like C and C++, it executes programs slower. Its user-friendliness makes it a popular language for citizen developers working with machine learning algorithms in low-code no-code (LCNC) software applications. Python has a simply syntax and is known for having a large community that actively contributes to a growing selection of software modules and libraries. Python’s initial development was spearheaded by Guido van Rossum in the late 1980s. Today, Python is managed by the Python Software Foundation."
    },
    {
        "_id": "04",
        "category_id": "04",
        "title": "Java",
        "image_url": "https://upload.wikimedia.org/wikipedia/en/thumb/3/30/Java_programming_language_logo.svg/1200px-Java_programming_language_logo.svg.png",
        "details": "Java was developed and released in 1995, much later after C and C++. As such it tends to solve some of the shortcomings cited in C and C++.For instance, it uses Javadoc, a documenting system that develops a systematic and organized method for documenting codes (Pawlan 1999).It also uses Byte code verifier which enhances correctness and security of the compiled code hence reducing the number of runtime checks. This implies that with the knowledge of Java, one can comfortably take up programming tasks in C and C++ or any other language. Java is also purely object oriented, easy to interpret and has high execution performance. This makes it simple and easier to work with. For this reason, Java is sometimes referred to as “a powerful yet easy to learn and work with language” (Pawlan 1999).Java is the most widely used programming language by web developers for both simple complex programming tasks. Due to its much simplified user platform, most people tend to have a general notion that Java cannot be used to create much complicated web applications due to its simple platform."
    },
    {
        "_id": "05",
        "category_id": "05",
        "title": "Php",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/PHP-logo.svg/1200px-PHP-logo.svg.png",
        "details": "PHP is a well-known web programming language that has been widely used to create exceptional websites. According to W3Techs s PHP is being used by 82% of
        majority web server. This language is popular because of its collaborative features
        excellent HTML and database integration support.Today businesses are moving to the online world and looking for a proficient webdevelopment company which can make engaging websites to showcase their productsand services. the developers have to create websites and web apps of allcomplexities. He it can take tremendous time and effort to start from scratch thus the demand for a more structured development process came.PHP frameworks are the best solution! These frameworks can build websites and web applications of diverse sizes and complexity. The developers use their skills know and expertise to make a small static website to large scale complex enterprise content management systems. PHP frameworks can modernize the process of backend web development.
        Why choose a PHP framework? Modern web development demands scalability fast develop well organized structure reusab and maintained code. PHP framework can aid you to achieve success. It can provide great assistance in creatingexceptional website and apps like."
    },
    {
        "_id": "06",
        "category_id": "06",
        "title": "Swift",
        "image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Swift_logo.svg/2560px-Swift_logo.svg.png",
        "details": "Swift language has come on 2 June 2014. Swift is a modern language powerful and developer-friendly programing language. It was developed by Apple Inc for use of apple products like ipads ios tv and it also supports multiple devices. It is a language in which we can code easily to compile and run. Swift was designed for Apple products like Apple cocoa and Cocoa touch frameworks. Objective C C++ language code also runs in a swift language. Swift is an open-source language and built with an open LLVM compiler.
        Apples worldwide developer conference announces swift language on June 2 2014 Swift is powerful easy to code open-source languages were started in 2010 by Chris Lattner and its teammates Doug Gregor John McCall.The swift idea is taken from many languages like python ruby or c language."
    }
]